#### GroupTypeId Members

---

|  |
| --- |
| GroupTypeId Class   Properties   See Also |

The  GroupTypeId  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AdskModelProperties | "Model Properties" |
| Public property Static member | AlternateUnits | "Alternate Units" |
| Public property Static member | AnalysisResults | "Analysis Results" |
| Public property Static member | AnalyticalAlignment | "Analytical Alignment" |
| Public property Static member | AnalyticalModel | "Analytical Model" |
| Public property Static member | AnalyticalProperties | "Analytical Properties" |
| Public property Static member | Area | "Area" |
| Public property Static member | ConceptualEnergyData | "Conceptual Energy Data" |
| Public property Static member | ConceptualEnergyDataBuildingServices | "Energy Model - Building Services" |
| Public property Static member | Constraints | "Constraints" |
| Public property Static member | Construction | "Construction" |
| Public property Static member | ContinuousrailBeginBottomExtension | "Extension (Beginning/Bottom)" |
| Public property Static member | ContinuousrailEndTopExtension | "Extension (End/Top)" |
| Public property Static member | CouplerArray | "Set" |
| Public property Static member | CurtainGrid | "Grid" |
| Public property Static member | CurtainGridHoriz | "Horizontal Grid" |
| Public property Static member | CurtainGridn1 | "Grid 1" |
| Public property Static member | CurtainGridn2 | "Grid 2" |
| Public property Static member | CurtainGridU | "U Grid" |
| Public property Static member | CurtainGridV | "V Grid" |
| Public property Static member | CurtainGridVert | "Vertical Grid" |
| Public property Static member | CurtainMullionHoriz | "Horizontal Mullions" |
| Public property Static member | CurtainMullionn1 | "Grid 1 Mullions" |
| Public property Static member | CurtainMullionn2 | "Grid 2 Mullions" |
| Public property Static member | CurtainMullionVert | "Vertical Mullions" |
| Public property Static member | Data | "Data" |
| Public property Static member | Display | "Display" |
| Public property Static member | DivisionGeometry | "Division Geometry" |
| Public property Static member | Electrical | "Electrical" |
| Public property Static member | ElectricalAnalysis | "Electrical Analysis" |
| Public property Static member | ElectricalCircuiting | "Electrical - Circuiting" |
| Public property Static member | ElectricalEngineering | "Electrical Engineering" |
| Public property Static member | ElectricalLighting | "Electrical - Lighting" |
| Public property Static member | ElectricalLoads | "Electrical - Loads" |
| Public property Static member | EnergyAnalysis | "Energy Analysis" |
| Public property Static member | EnergyAnalysisAdvanced | "Advanced" |
| Public property Static member | EnergyAnalysisBldgConsMtlThermalProps | "Material Thermal Properties" |
| Public property Static member | EnergyAnalysisBuildingData | "Building Data" |
| Public property Static member | EnergyAnalysisConceptualModel | "Energy Analytical Model" |
| Public property Static member | EnergyAnalysisDetailedAndConceptualModels | "Essential" |
| Public property Static member | EnergyAnalysisDetailedModel | "Detailed Model" |
| Public property Static member | EnergyAnalysisRoomSpaceData | "Room/Space Data" |
| Public property Static member | FabricationProductData | "Fabrication Product Data" |
| Public property Static member | FireProtection | "Fire Protection" |
| Public property Static member | Fitting | "Fittings" |
| Public property Static member | Flexible | "Adaptive Component" |
| Public property Static member | Forces | "Forces" |
| Public property Static member | General | "General" |
| Public property Static member | GeoLocation | "Geolocation" |
| Public property Static member | Geometry | "Dimensions" |
| Public property Static member | GeometryPositioning | "Geometric Position" |
| Public property Static member | Graphics | "Graphics" |
| Public property Static member | GreenBuilding | "Green Building Properties" |
| Public property Static member | IdentityData | "Identity Data" |
| Public property Static member | Ifc | "IFC Parameters" |
| Public property Static member | Insulation | "Insulation" |
| Public property Static member | Length | "Length" |
| Public property Static member | LifeSafety | "Life Safety" |
| Public property Static member | LightPhotometrics | "Photometrics" |
| Public property Static member | Lining | "Lining" |
| Public property Static member | Materials | "Materials and Finishes" |
| Public property Static member | Mechanical | "Mechanical" |
| Public property Static member | MechanicalAirflow | "Mechanical - Flow" |
| Public property Static member | MechanicalLoads | "Mechanical - Loads" |
| Public property Static member | Moments | "Moments" |
| Public property Static member | Nodes | "Nodes" |
| Public property Static member | OverallLegend | "Overall Legend" |
| Public property Static member | Pattern | "Pattern" |
| Public property Static member | PatternApplication | "Pattern Application" |
| Public property Static member | Phasing | "Phasing" |
| Public property Static member | Plumbing | "Plumbing" |
| Public property Static member | PrimaryEnd | "Primary End" |
| Public property Static member | PrimaryUnits | "Primary Units" |
| Public property Static member | Profile | "Profile" |
| Public property Static member | Profilen1 | "Profile 1" |
| Public property Static member | Profilen2 | "Profile 2" |
| Public property Static member | RailingSystemFamilyHandrails | "Handrail 1" |
| Public property Static member | RailingSystemFamilySegmentPattern | "Segment Pattern (default)" |
| Public property Static member | RailingSystemFamilyTopRail | "Top Rail" |
| Public property Static member | RailingSystemSecondaryFamilyHandrails | "Handrail 2" |
| Public property Static member | RailingSystemSegmentPatternRemainder | "Pattern Remainder" |
| Public property Static member | RailingSystemSegmentPatternRepeat | "Pattern Repeat" |
| Public property Static member | RailingSystemSegmentPosts | "Posts" |
| Public property Static member | RailingSystemSegmentUGrid | "U Grid" |
| Public property Static member | RailingSystemSegmentVGrid | "V Grid" |
| Public property Static member | RebarArray | "Rebar Set" |
| Public property Static member | RebarSystemLayers | "Layers" |
| Public property Static member | Reference | "Reference" |
| Public property Static member | ReleasesMemberForces | "Releases / Member Forces" |
| Public property Static member | RotationAbout | "Rotation about" |
| Public property Static member | RouteAnalysis | "Route Analysis" |
| Public property Static member | SecondaryEnd | "Secondary End" |
| Public property Static member | SegmentsFittings | "Segments and Fittings" |
| Public property Static member | SlabShapeEdit | "Slab Shape Edit" |
| Public property Static member | SplitProfileDimensions | "Dimensions (linear units or % of thickness)" |
| Public property Static member | StairRisers | "Risers" |
| Public property Static member | StairsCalculatorRules | "Calculation Rules" |
| Public property Static member | StairsOpenEndConnection | "End Connection" |
| Public property Static member | StairsSupports | "Supports" |
| Public property Static member | StairsTreadsRisers | "Threads/Risers" |
| Public property Static member | StairStringers | "Stringers" |
| Public property Static member | StairsWinders | "Winders" |
| Public property Static member | StairTreads | "Treads" |
| Public property Static member | Structural | "Structural" |
| Public property Static member | StructuralAnalysis | "Structural Analysis" |
| Public property Static member | StructuralSectionGeometry | "Structural Section Geometry" |
| Public property Static member | Support | "Supports" |
| Public property Static member | SystemtypeRisedrop | "Rise / Drop" |
| Public property Static member | Termination | "Terminations" |
| Public property Static member | Text | "Text" |
| Public property Static member | Title | "Title Text" |
| Public property Static member | TranslationIn | "Translation in" |
| Public property Static member | TrussFamilyBottomChord | "Bottom Chords" |
| Public property Static member | TrussFamilyDiagWeb | "Diagonal Webs" |
| Public property Static member | TrussFamilyTopChord | "Top Chords" |
| Public property Static member | TrussFamilyVertWeb | "Vertical Webs" |
| Public property Static member | Underlay | "Underlay" |
| Public property Static member | ViewCamera | "Camera" |
| Public property Static member | ViewExtents | "Extents" |
| Public property Static member | Visibility | "Visibility" |
| Public property Static member | WallCrossSectionDefinition | "Cross-Section Definition" |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace